<h3> Tools for Data Science Assignment Week 9 Pandas </h3>

In [ ]:
import pandas as pd
import numpy as np
import json

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3aietf%3awg%3aoauth%3a2.0%3aoob&scope=email%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdocs.test%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive.photos.readonly%20https%3a%2f%2fwww.googleapis.com%2fauth%2fpeopleapi.readonly&response_type=code

Enter your authorization code:
··········
Mounted at /content/drive

<b> Dataset 1: Twitter Data #stayhome </b> <br>
https://www.kaggle.com/robertvici/stay-at-home-tweets-covid19 <br>


ลิงค์ดาว์นโหลดข้อมูล ช่วงเวลาวันที่ 13, 14, 15, 16 มีนาคม 2563 <br>
https://drive.google.com/drive/folders/1vjDWn2w2bFpU8mRm1ItvBdg2LHPHGCtd?usp=sharing <br>

<b> คำถาม </b>
1. แสดงจำนวนครั้งของ tweet ที่มีคำว่า covid ในแต่ละวัน (ที่มีให้ในข้อมูล)
2. แสดงชื่อ User ที่ tweet หรือใช้ hashtags คำว่า covid หรือ stayAtHome มากที่สุด 10 อันดับ
3. แสดงชื่อ User ที่มีจำนวน mentions มากที่สุดเรียง 10 อันดับ
4. User  ที่มีการ tweet หรือ ใช้ hashtag ว่า covid ในช่วงเวลากลางวัน (6:00AM - 6:00PM) มากที่สุด คือ user ใด
5. User  ที่มีความแตกต่างของการ tweet หรือใช้ hashtag ว่า covid ในช่วงเวลากลางวัน (6:00AM - 6:00PM) กับช่วงเวลากลางคืน (6:00PM - 6:00AM) มากที่สุด คือ user ใด

In [ ]:
# Read Json
pd.set_option('display.max_rows', False)
path = '/content/drive/My Drive/88950162_tools_for_data_science_101/63910161_python/week8/'

dataFilePath1 = path + r'2020-03-13.json'
dataFilePath2 = path + r'2020-03-14.json'
dataFilePath3 = path + r'2020-03-15.json'
dataFilePath4 = path + r'2020-03-16.json'

df1 = pd.read_json(dataFilePath1)
df2 = pd.read_json(dataFilePath2)
df3 = pd.read_json(dataFilePath3)
df4 = pd.read_json(dataFilePath4)

# Mergeing data
df = [df1, df2, df3, df4]
df = pd.concat(df)

# Export Data to CSV
df.to_csv('tweet_data.csv', encoding='utf-8')

In [ ]:
# Read file
dataFilePath =  '/content/tweet_data.csv'

df = pd.read_csv(dataFilePath, index_col=0)

In [ ]:
# 1.แสดงจำนวนครั้งของ tweet ที่มีคำว่า covid ในแต่ละวัน (ที่มีให้ในข้อมูล)
covid_ = df[df['tweet'].str.contains("covid")]
covid_.groupby(['date'])['tweet'].count()

date
2020-03-13 00:00:00     433
2020-03-14 00:00:00     339
2020-03-15 00:00:00     462
2020-03-16 00:00:00    1150
Name: tweet, dtype: int64

In [ ]:
# 2.แสดงชื่อ User ที่ tweet หรือใช้ hashtags คำว่า covid หรือ stayAtHome มากที่สุด 10 อันดับ
covid_stayAtHome_ = df[(df['tweet'].str.contains("covid")) | \
                       (df['tweet'].str.contains("stayAtHome")) | \
                       (df['hashtags'].str.contains("covid")) | \
                       (df['hashtags'].str.contains("stayAtHome"))]

covid_stayAtHome_['tweet_covid'] = covid_stayAtHome_['tweet'].str.count('covid')
covid_stayAtHome_['tweet_stayAtHome'] = covid_stayAtHome_['tweet'].str.count('stayAtHome')
covid_stayAtHome_['hashtags_covid'] = covid_stayAtHome_['hashtags'].str.count('covid')
covid_stayAtHome_['hashtags_stayAtHome'] = covid_stayAtHome_['hashtags'].str.count('stayAtHome')

covid_stayAtHome_['count_Token'] = covid_stayAtHome_.tweet_covid \
                                   + covid_stayAtHome_.tweet_stayAtHome \
                                   + covid_stayAtHome_.hashtags_covid \
                                   + covid_stayAtHome_.hashtags_stayAtHome

covid_stayAtHome_ = covid_stayAtHome_.sort_values(['count_Token'], ascending=False)

username_ = covid_stayAtHome_.groupby('username').sum()
username_[['count_Token']].sort_values(['count_Token'], ascending=False).head(10)

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  after removing the cwd from sys.path.
/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """
/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  import sys
/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:9: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  if __name__ == '__main__':

                 count_Token
username
yassd32k1               38.0
jl_mico                 31.0
barpyplatwurst          28.0
coronavirusari1         24.0
kick_please             24.0
ulli39989686            22.0
crwth_                  21.0
english_as              19.0
capitangian             19.0
deepinspection          18.0

In [ ]:
# 3.แสดงชื่อ User ที่มีจำนวน mentions มากที่สุดเรียง 10 อันดับ

mentions_ = df[['username', 'mentions']]
mentions_['count'] = df.mentions.str.len()

mentions_ = mentions_.groupby('username').sum()
mentions_.sort_values(['count'], ascending=False).head(10)

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  after removing the cwd from sys.path.

                 count
username
athanasiatrian1   1676
gazza41           1573
nielsockelmann    1572
florian_vienna    1375
jasb1001          1140
melbprieto        1125
mokum_misfit      1113
lwjanssen          887
martinis2018       790
christinerap74     790

In [ ]:
# 4.User ที่มีการ tweet หรือ ใช้ hashtag ว่า covid ในช่วงเวลากลางวัน (6:00AM - 6:00PM) มากที่สุด คือ user ใด
# covid_user_ = df[(df['tweet'].str.contains("covid")) | (df['hashtags'].str.contains("covid"))]

# covid_user_['created_at'] = pd.to_datetime(covid_user_['created_at'])
# covid_user_.info()

# covid_user_['datehour'] = covid_user_.created_at.dt.hour
# covid_user_

In [ ]:
# 5.User ที่มีความแตกต่างของการ tweet หรือใช้ hashtag ว่า covid ในช่วงเวลากลางวัน (6:00AM - 6:00PM) กับช่วงเวลากลางคืน (6:00PM - 6:00AM) มากที่สุด คือ user ใด

<b> Dataset 2: Data Analyst Jobs 2253 job listings scraped from glassdoor </b> <br> https://www.kaggle.com/andrewmvd/data-analyst-jobs
<br>
<table>
  <tr>
    <th> Column name </th>
    <th> Description </th>
  </tr>
  <tr>
    <td> Job Title </td>
    <td> Job title </td>
  </tr>
  <tr>
    <td> Salary Estimate </td>
    <td> Glassdoor salary estimate </td>
  </tr>
  <tr>
    <td> Job Desciption </td>
    <td> Job description </td>
  </tr>
  <tr>
    <td> Rating </td>
    <td> Company rating </td>
  </tr>
  <tr>
    <td> Company Name </td>
    <td> Company Name </td>
  </tr>
  <tr>
    <td> Location </td>
    <td> Location </td>
  </tr>
  <tr>
    <td> Headquaters </td>
    <td> Company Headquaters location </td>
  </tr>
  <tr>
    <td> Size </td>
    <td> Company size by number of employess </td>
  </tr>
  <tr>
    <td> Founded </td>
    <td> Year the compnany was founded
  </tr>
</table>

In [ ]:
path = '/content/drive/My Drive/88950162_tools_for_data_science_101/63910161_python/week8/'
data = pd.read_csv(path +'DataAnalyst.csv')

<b> Part 1: Data Cleaning </b>
- ลบคอลัมภ์ Unnamed: 0 
- แทนค่า -1 หรือ -1.0 หรือ '-1' ด้วยค่า NaN ทุกคอลัมภ์
- สร้างคอลัมภ์ Department จากแบ่งข้อมูลในคอลัมภ์ Job Title
- เช็คดูว่าข้อมูลในคอลัมภ์ Company_Name ในการลบ \n
- แบ่งข้อมูลจากคอลัมภ์ Salary Estimate ออกเป็นคอลัมภ์ 
salary น้อยที่สุด (Min_Salary) และคอลัมภ์ salary มากที่สุด (Max_Salary)

In [ ]:
# ลบคอลัมภ์ Unnamed: 0
data = data.drop(columns="Unnamed: 0")

In [ ]:
# แทนค่า -1 หรือ -1.0 หรือ '-1' ด้วยค่า NaN ทุกคอลัมภ์

data = data.replace(-1, np.NaN)
data = data.replace(-1.0, np.NaN)
data = data.replace('-1', np.NaN)
data = data.replace('-1.0', np.NaN)

In [ ]:
# สร้างคอลัมภ์ Department จากแบ่งข้อมูลในคอลัมภ์ Job Title
data['Department'] = data['Job Title']

In [ ]:
# เช็คดูว่าข้อมูลในคอลัมภ์ Company Name ในการลบ \n
data['Company Name'] = data['Company Name'].str.replace('\n', ' ')

In [ ]:
# แบ่งข้อมูลจากคอลัมภ์ Salary Estimate ออกเป็นคอลัมภ์ salary น้อยที่สุด (Min_Salary) และคอลัมภ์ salary มากที่สุด (Max_Salary)
data['Min_Salary'] = data['Salary Estimate'].str.replace('$', ' ').str.replace('K', ' ').str.replace('-', ' ').str.split().str[0]
data['Max_Salary'] = data['Salary Estimate'].str.replace('$', ' ').str.replace('K', ' ').str.replace('-', ' ').str.split().str[1]

<b> Part 2: Data Selection </b>

1. แสดงตำแหน่งงาน (Job Title) ที่เกิดขึ้นมากที่สุดโดยเรียงจากมากไปน้อย

In [ ]:
data.groupby('Job Title')['Job Title'].count().sort_values(ascending=False)

Job Title
Data Analyst                                                            405
Senior Data Analyst                                                      90
Junior Data Analyst                                                      30
Business Data Analyst                                                    28
Sr. Data Analyst                                                         21
                                                                       ...
Mid Level Data Analyst / BI Engineer - Looker, Python, Client Facing      1
Mid-Level Data Analyst                                                    1
Mid-Senior Data Analyst                                                   1
Music Copyright Data Analyst                                              1
#104252 Division Data and Financial Analyst                               1
Name: Job Title, Length: 1272, dtype: int64

2. แสดงชื่อเมืองที่ตำแหน่งที่เกิดขึ้นมากที่สุด โดยเรียงจากมากไปน้อย

In [ ]:
data.groupby('Company Name')['Company Name'].count().sort_values(ascending=False)

      Unnamed: 0  ... Easy Apply
0              0  ...       True
1              1  ...         -1
2              2  ...         -1
3              3  ...         -1
4              4  ...       True
...          ...  ...        ...
2248        2248  ...         -1
2249        2249  ...         -1
2250        2250  ...         -1
2251        2251  ...         -1
2252        2252  ...         -1

[2253 rows x 16 columns]

3. แสดงการประมาณค่าเงินเดือน(Salary Estimate)ที่เกิดขึ้นมากที่สุด โดยเรียงจากมากไปน้อย

In [ ]:
salary_ = data.groupby('Salary Estimate')['Salary Estimate'].count().sort_values(ascending=False).head(10)
salary_

Salary Estimate
$42K-$76K (Glassdoor est.)     57
$41K-$78K (Glassdoor est.)     57
$50K-$86K (Glassdoor est.)     41
$35K-$67K (Glassdoor est.)     33
$43K-$76K (Glassdoor est.)     31
$60K-$124K (Glassdoor est.)    31
$58K-$93K (Glassdoor est.)     31
$37K-$66K (Glassdoor est.)     30
$60K-$66K (Glassdoor est.)     30
$60K-$110K (Glassdoor est.)    30
Name: Salary Estimate, dtype: int64

4. แสดงบริษัท (companies) ที่มีจากจ้างงานตำแหน่ง Data analyst มากที่สุด 10 อันดับ โดยดูจาก Easy Apply ที่มีค่าเป็นจริง (1)

In [ ]:
data[data['Easy Apply'] == 'True'].head(10)

                                            Job Title  ... Max_Salary
0   Data Analyst, Center on Immigration and Justic...  ...         66
4                              Reporting Data Analyst  ...         66
7                                Data Science Analyst  ...         66
13                                Senior Data Analyst  ...         66
16                                       Data Analyst  ...         66
30                                       Data Analyst  ...         87
47                                       Data Analyst  ...         87
82                    Healthcare Data Analyst, Qsight  ...         88
88                          Quantitative Data Analyst  ...         88
94                                       Data Analyst  ...         87

[10 rows x 18 columns]

5. แสดงเมือง (Location) ที่ให้ที่คำนวณ salary น้อยและมากที่สุด โดยเรียงจากค่า Max_Salary และ Min_Salary ที่มากที่สุด

In [ ]:
data['Min_Salary'] = data['Min_Salary'].fillna(0) 
data['Max_Salary']= data['Max_Salary'].fillna(0) 

data['Min_Salary'] = data['Min_Salary'].astype('float64')
data['Max_Salary'] = data['Max_Salary'].astype('float64')
data.groupby('Location')[['Min_Salary', 'Max_Salary']].agg({'Min_Salary' : 'min', 'Max_Salary': 'max' })

                    Min_Salary  Max_Salary
Location
Addison, TX               41.0        86.0
Alachua, FL               30.0        54.0
Alameda, CA               47.0        74.0
Alhambra, CA              35.0        81.0
Allegheny West, PA        37.0        93.0
Allen, TX                 24.0        88.0
American Fork, UT         26.0        47.0
Anaheim, CA               37.0       132.0
Arcadia, CA               42.0       132.0
...                        ...         ...
Whippany, NJ              48.0       114.0
Whitestown, IN            34.0        61.0
Whittier, CA             113.0       132.0
Wilmington, DE            37.0        93.0
Woodbridge, NJ            98.0       114.0
Woodcliff Lake, NJ        48.0        96.0
Woodland Hills, CA        42.0       132.0
Woodridge, IL             42.0        82.0
Yorktown, VA              43.0        69.0

[253 rows x 2 columns]

6. แสดงตำแหน่งโดยใช้ Job Title ที่ได้เงินเดือนน้อยและมากที่สุด จากค่า Max_Salary และ Min_Salary ที่มากที่สุด

In [ ]:
data['Min_Salary'] = data['Min_Salary'].fillna(0) 
data['Max_Salary']= data['Max_Salary'].fillna(0) 

data['Min_Salary'] = data['Min_Salary'].astype('int64')
data['Max_Salary'] = data['Max_Salary'].astype('int64')
data.groupby('Job Title')[['Min_Salary', 'Max_Salary']].agg({'Min_Salary' : 'min', 'Max_Salary': 'max' })

                                                    Min_Salary  Max_Salary
Job Title
#104252 Division Data and Financial Analyst                 34          61
#105009 Research Data Analyst                               60         124
(Data Analyst) BA/BSA                                       45          78
(Data Risk Analyst: Data Modeler)                           35          67
(REMOTE) Sr. Risk Analyst (IT, IS and/or Data e...          73          89
(Risk Data Analyst)                                         35          67
+ Global Process Data Analyst                               57          70
.Net Developer - Program Data Design Analyst                74         123
.net, sharepoint, Java, Data analyst, Business ...          27          52
...                                                        ...         ...
Workday EIB Data Analyst                                    51          93
Workday Technical Analyst- Data Conversions                 37          70
Workforce Data Analyst                                      42          76
XYZ Data Analyst                                            29          38
a. Senior Data and Business Analyst                         31          59
eCommerce Data Analyst                                      73         127
eDiscovery Data Analyst                                     74         123
{"title":"GAO Analyst (Data Analysis)","extende...          49          91
【1yr OPT+Intern】Data Analyst 保实习保就业                         42          66

[1272 rows x 2 columns]

7. แสดงรายได้ที่ (Revenue) ตามอุตสากรรม (industries) โดยเรียงจากมากไปน้อย 10 อันดับ

In [ ]:
def filter_revenue(x):
    revenue=0
    if(x== 'Unknown / Non-Applicable' or type(x)==float):
        revenue=0
    elif(('million' in x) and ('billion' not in x)):
        maxRev = x.replace('(USD)','').replace("million",'').replace('$','').strip().split('to')
        if('Less than' in maxRev[0]):
            revenue = float(maxRev[0].replace('Less than','').strip())
        else:
            if(len(maxRev)==2):
                revenue = float(maxRev[1])
            elif(len(maxRev)<2):
                revenue = float(maxRev[0])
    elif(('billion'in x)):
        maxRev = x.replace('(USD)','').replace("billion",'').replace('$','').strip().split('to')
        if('+' in maxRev[0]):
            revenue = float(maxRev[0].replace('+','').strip())*1000
        else:
            if(len(maxRev)==2):
                revenue = float(maxRev[1])*1000
            elif(len(maxRev)<2):
                revenue = float(maxRev[0])*1000
    return revenue

In [ ]:
for x in range(0, len(data['Revenue'])):
  data['Revenue'][x] = filter_revenue(data['Revenue'][x])

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [ ]:
data.groupby('Industry')['Revenue'].sum().sort_values(ascending=False).head(10)

Industry
Investment Banking & Asset Management      480586.0
Staffing & Outsourcing                     303013.0
Computer Hardware & Software               300033.0
Insurance Carriers                         267625.0
Health Care Services & Hospitals           260977.0
Banks & Credit Unions                      213000.0
IT Services                                182331.0
Internet                                   128082.0
Enterprise Software & Network Solutions    116062.0
Aerospace & Defense                        107450.0
Name: Revenue, dtype: float64

8. แสดงจำนวนนับจำนวนบริษัทที่ก่อตั้งตามปี (Founded) ตั้งแต่ปี 2010

In [ ]:
Founded_ = data[data['Founded'] >= 2010].sort_values('Founded')
Founded_.groupby('Company Name')['Company Name'].count().sort_values(ascending=False)

Company Name
Praescient Analytics 3.1                5
TechProjects 4.8                        4
TikTok 3.8                              4
CYNET SYSTEMS 4.0                       4
InvenTech Info 4.8                      3
Flexport 3.5                            3
Swoon 4.6                               3
Chime 4.8                               3
Zachary Piper Solutions, LLC 3.9        3
Mount Sinai Health System 3.4           3
Signify Health 3.6                      3
Piper Companies 4.5                     3
                                       ..
PubNub 4.1                              1
Professional Enrollment Concepts 3.3    1
ProMedia 4.4                            1
Principle Auto 4.1                      1
Poshmark 4.8                            1
Point72 3.9                             1
Pieces Technology, Inc. 4.9             1
Perfect Day 4.4                         1
People Tree                             1
Pareto Systems 4.3                      1
PUBG Santa Monica 4.5                   1
ARK Solutions, Inc. 3.9                 1
Name: Company Name, Length: 201, dtype: int64

<h3> Dataset 3: Netflix Movies and TV Shows </h3>
This dataset consists of tv shows and movies available on Netflix as of 2019. The dataset is collected from Flixable which is a third-party Netflix search engine.

https://www.kaggle.com/shivamb/netflix-shows

In [ ]:
path = '/content/drive/My Drive/88950162_tools_for_data_science_101/63910161_python/week8/'
data = pd.read_csv(path +'netflix_titles.csv')

In [ ]:
## add new features in the dataset
data["date_added"] = pd.to_datetime(data['date_added'])
data["year_added"] = data['date_added'].dt.year
data["month_added"] = data['date_added'].dt.month

data['season_count'] = data.apply(lambda x : x['duration'].split(" ")[0] if "Season" in x ['duration'] else "", axis = 1)
data['duration'] = data.apply(lambda x : x['duration'].split(" ")[0] if "Season" in x ['duration'] else "", axis = 1)

1. แสดงจำนวนของ type ใน content ของ Netflix ทั้งหมด

In [ ]:
data.groupby('type')['type'].count()

type
Movie      4265
TV Show    1969
Name: type, dtype: int64

2. แสดงจำนวน content (type) ที่ถูกเพิ่มลงใน Netflix ในแต่ละปี (year_added)

In [ ]:
# pd.set_option('display.max_rows', False)
data['year_added'] = data['date_added'].str.replace(',', ' ').str.split().str[2]
data.groupby(['year_added', 'type'])['type'].count()

year_added  type
2008        Movie         1
            TV Show       1
2009        Movie         2
2010        Movie         1
2011        Movie        13
2012        Movie         4
            TV Show       3
2013        Movie         6
            TV Show       6
2014        Movie        19
            TV Show       6
2015        Movie        58
            TV Show      32
2016        Movie       264
            TV Show     192
2017        Movie       913
            TV Show     387
2018        Movie      1290
            TV Show     492
2019        Movie      1546
            TV Show     803
2020        Movie       147
            TV Show      37
Name: type, dtype: int64

3. นับจำนวน content แบบ tv show ที่ถูกเพิ่ม (date_added) ในแต่ละเดือนของทุกๆ ปีมากที่สุด

In [ ]:
tv_ = data[data['type'] == 'TV Show']
tv_.groupby(['year_added', 'type'])['type'].count()

year_added  type
2008        TV Show      1
2012        TV Show      3
2013        TV Show      6
2014        TV Show      6
2015        TV Show     32
2016        TV Show    192
2017        TV Show    387
2018        TV Show    492
2019        TV Show    803
2020        TV Show     37
Name: type, dtype: int64

4. แสดงจำนวนประเภทที่มีจำนวน content ทั้งแบบ tv show และ movie บน Netflix ที่ฉาย (release_year) ตั้งแต่ปี 2010

In [ ]:
release_year = data[data['release_year'] >= 2010]
release_year.groupby(['type'])['type'].count()

type
Movie      3416
TV Show    1814
Name: type, dtype: int64

5. แสดงนับจำนวนว่า TV show มีกี่จำนวนกี่ Seasons เรียงจากจำนวน Seasons จากมาไปน้อย

In [ ]:
season_ = data[(data['type'] == 'TV Show') & (data.duration.str.contains("Season"))]
season_.groupby('duration')['duration'].count().sort_values(ascending=False)

duration
1 Season      1321
2 Seasons      304
3 Seasons      158
4 Seasons       61
5 Seasons       46
6 Seasons       22
7 Seasons       21
8 Seasons       16
9 Seasons        7
11 Seasons       3
10 Seasons       3
15 Seasons       2
13 Seasons       2
12 Seasons       2
14 Seasons       1
Name: duration, dtype: int64

6. แสดงนับจำนวน rating ของ content ที่เป็นทั้ง tv shows และ movies

In [ ]:
data.groupby(['type', 'rating'])['rating'].count()

type     rating
Movie    G             36
         NC-17          2
         NR           202
         PG           183
         PG-13        286
         R            506
         TV-14       1038
         TV-G          80
         TV-MA       1348
         TV-PG        432
         TV-Y          41
         TV-Y7         69
                     ...
         UR             7
TV Show  G              1
         NR            16
         PG             1
         R              2
         TV-14        660
         TV-G          69
         TV-MA        679
         TV-PG        269
         TV-Y         102
         TV-Y7        100
         TV-Y7-FV      68
Name: rating, Length: 25, dtype: int64

7. แสดงจำนวนกลุ่มของ content ทั้งหมดมากที่สุดทั้งหมด 15 อันดับ

In [ ]:
data['listed_in'] = data['listed_in'].str.split(',')

In [ ]:
list_ = pd.Series([item for sublist in data.listed_in for item in sublist])
cat = list_.value_counts().sort_index().rename_axis('categories').reset_index(name='count')
cat.sort_values('count', ascending=False).head(15)

                  categories  count
13      International Movies   1842
49                    Dramas   1077
44                  Comedies    803
47             Documentaries    644
37        Action & Adventure    597
53    International TV Shows    570
9                     Dramas    546
30                 TV Dramas    543
12        Independent Movies    534
14    International TV Shows    431
20           Romantic Movies    374
41  Children & Family Movies    358
36                 Thrillers    352
29               TV Comedies    347
4                   Comedies    310

8. แสดงรายชื่อนักแสดงภาพยนต์ (movie) ที่แสดงมากที่สุดโดยเรียงจากมากไปน้อย 10 อันดับ โดยเช็คว่าต้อง duration ของภาพยนตร์ไม่เท่ากับช่องว่าง (Null)

In [ ]:
movie_ = data[(data['type'] == 'Movie') & (data.director.notnull())]
movie_.groupby('director')['director'].count().sort_values(ascending=False).head(10)

director
Raúl Campos, Jan Suter    18
Marcus Raboy              14
Jay Karas                 13
Jay Chapman               12
Martin Scorsese            9
Steven Spielberg           9
Johnnie To                 8
David Dhawan               8
Lance Bangs                8
Hakan Algül                7
Name: director, dtype: int64